app/controllers/songs_controller.rb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
SELECT "songs".* FROM "songs"
---
  def index
    # if params[:artist_id] != Artist.find_by(id: params[artist_id])
    #   flash[:alert] = "Artist not found."
    #   redirect_to artists_path
    # else
    #   @songs = Artist.find(params[:artist_id]).songs
    # end

    if params[:artist_id]
      @artist = Artist.find_by(id: params[:artist_id])
      if @artist.nil?
        flash[:alert] = "Artist not found."
        redirect_to artists_path
      else
        @songs = @artist.songs
      end
    else
      @songs = Song.all

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    # if @artist.songs.find_by(id: params[:id]) == true
    #   @song = Song.find_by(id: params[:id])
    # elsif params[id: id] == true && params[:artist_id] == true
    #   @song = Song.find_by(id: params[:id])
    # else
    #   flash[:alert] = "Song not found."
    #   redirect_to artist_songs_path(@artist)
    # end

    if params[:artist_id]
      @artist = Artist.find_by(id: params[:artist_id])
      @song = Song.find_by(id: params[:id])